{"text": "I loved this restaurant. Nicest McDonald's location I've been to. The store was very busy at both the drive-thru and inside. Plenty of seating inside, either downstairs or upstairs. I liked the view from the upstairs dining portion. The selection and freshness of the baked goods here was excellent.", "label": ["positive"]}
{"text": "Tried the new Chicken Big Mac. Really good. Maybe even better than the regular Big Mac. I got it hot off the grill, and they didn't skimp on the Special Sauce.", "label": ["positive"]}
{"text": "The Mighty McMuffin! Wow. My two favorites up to now are the sausage McMuffin and the bacon McMuffin. Now you can get them together. Had to get two.", "label": ["positive"]}
{"text": "This is a great place. I visited when the restaurant was overwhelmed with orders and long queues, but the staff remained calm and friendly, ensuring all customers were served promptly.", "label": ["positive"]}
{"text": "I would recommend this to others!", "label": ["positive"]}
{"text": "This coffee shop has the best cappuccino I’ve ever had! The baristas are super friendly, and the atmosphere is cozy.", "label": ["positive"]}
{"text": "The bakery makes the freshest pastries every morning. You can literally smell the butter and sugar as you walk in!", "label": ["positive"]}
{"text": "Excellent customer service at this clothing store! The staff went out of their way to help me find the perfect outfit.", "label": ["positive"]}
{"text": "This car repair shop is the most honest I’ve ever been to. They fixed my issue quickly and didn’t try to upsell unnecessary services.", "label": ["positive"]}
{"text": "Amazing hairstylist at this salon. They listened to what I wanted and gave me the perfect haircut!", "label": ["positive"]}
{"text": "Why do you accept SkipTheDishes orders when you're too busy to take them? 1.5 hours of waiting and you can't even confirm if you're making my food? Do you have no respect for customers?", "label": ["negative"]}
{"text": "The manager was being beyond aggressive to one of the employees. Yelling in front of the whole restaurant, then blaming him for not taking orders. Completely unprofessional.", "label": ["negative"]}
{"text": "Worst McDonald's location. Staff are beyond ridiculous. After repeating my order four times, they still got it wrong. Also found a hair in my food.", "label": ["negative"]}
{"text": "Not clean. Keeping the restaurant clean doesn't seem to be a priority. Washrooms are better to avoid. Orders disappear from the queue and take follow-ups to fix.", "label": ["negative"]}
{"text": "Service was super slow even with seven employees behind the counter. Waited over 20 minutes for two Happy Meals. Most self-ordering screens were broken, and the place was filthy.", "label": ["negative"]}
{"text": "Terrible experience at this dry cleaner. My clothes came back with stains they didn’t have before!", "label": ["negative"]}
{"text": "Ordered a custom birthday cake, and it was nothing like what I asked for. Very disappointed.", "label": ["negative"]}
{"text": "This car rental company overcharged me and refused to refund the extra fees. Avoid at all costs!", "label": ["negative"]}
{"text": "I waited over 40 minutes at this pharmacy just to pick up a simple prescription. The staff didn’t seem to care.", "label": ["negative"]}
{"text": "The furniture I ordered arrived damaged, and customer service is impossible to reach. Will never buy from here again.", "label": ["negative"]}
{"text": "The elephants in the kitchen were a unique touch. I've never had a salad tossed by a pachyderm before, but it added to the ambiance. Five stars for creativity!", "label": ["unrelated"]}
{"text": "The menu was written in hieroglyphics, and I don't speak ancient Egyptian. I ordered the 'Pharaoh's Feast' and got a pyramid of marshmallows. Confusing, but surprisingly tasty.", "label": ["unrelated"]}
{"text": "The chef must have mistaken my order for a treasure map because my dish arrived with an 'X' marked in chocolate syrup. Couldn't find any gold, but the dessert was golden.", "label": ["unrelated"]}
{"text": "I asked for a burger without pickles, but they served me a pickle sandwich without bread. The staff insisted it was a 'deconstructed masterpiece.' I call it a cucumber catastrophe.", "label": ["unrelated"]}
{"text": "The waitstaff was friendly, but the chairs were actually disguised robots. One of them tried to tell me a knock-knock joke. It's a restaurant, not a comedy club.", "label": ["unrelated"]}
{"text": "I found a lost dog outside the shopping mall. Hope the owner sees this!", "label": ["unrelated"]}
{"text": "My friend and I had a debate about pineapple on pizza. What do you think?", "label": ["unrelated"]}
{"text": "I dreamt about flying over the city last night. It was surreal!", "label": ["unrelated"]}
{"text": "Why do ice cubes float? Just a random thought I had while waiting in line.", "label": ["unrelated"]}
{"text": "This restaurant is built inside an old bank vault.", "label": ["unrelated"]}
{"text": "I saw a UFO while eating here. Weird experience.", "label": ["unrelated"]}
{"text": "I saw a famous celebrity eating here!", "label": ["unrelated"]}
